[
  {
    "name": "Thomas A. Anderson",
    "area": "Desenvolvimento",
    "summary": "Profissional de tecnologia com 5 anos de experiência em desenvolvimento de software e análise de dados, com habilidades técnicas em Python, Java, JavaScript, SQL, React, Node.js, Django, entre outros.",
    "skills": [
      "Python",
      "Java",
      "JavaScript",
      "SQL",
      "React",
      "Node.js",
      "Django",
      "MySQL",
      "MongoDB",
      "PostgreSQL",
      "Git",
      "Docker",
      "Jupyter Notebook",
      "Power BI",
      "AWS",
      "Google Cloud Platform",
      "Pandas",
      "NumPy",
      "Tableau"
    ],
    "education": "Bacharelado em Ciência da Computação pela Universidade de São Paulo (USP) - São Paulo, SP",
    "interview_questions": [
      "Como você acha que pode contribuir para a nossa empresa com sua experiência em análise de dados?",
      "Você pode explicar como você implementou testes automatizados em sua experiência anterior?",
      "Como você aborda a análise estatística e modelagem de dados em seus projetos?"
    ],
    "strengths": [
      "Experiência em análise de dados e desenvolvimento de software",
      "Habilidades técnicas em diversas tecnologias",
      "Experiência em ambientes ágeis (Scrum)"
    ],
    "areas_for_development": [
      "Necessidade de aprimorar habilidades em análise estatística e modelagem de dados",
      "Pouca experiência em serviços de nuvem (AWS, Google Cloud Platform)"
    ],
    "important_considerations": [
      "Verificar experiência prática com ferramentas de Business Intelligence como Power BI, Tableau ou Looker"
    ],
    "final_recommendations": "O candidato apresenta uma boa combinação de habilidades técnicas e experiência em análise de dados, mas é importante verificar sua experiência prática com ferramentas de Business Intelligence e serviços de nuvem. Recomendo seguir com a entrevista para avaliar melhor sua aptidão para a vaga.",
    "score": 8.5
  },
  {
    "name": "Ana Clara Santos",
    "area": "Desenvolvimento",
    "summary": "Desenvolvedora de software com 4 anos de experiência em desenvolvimento de soluções web, especializada em React e Vue.js, com habilidades em DevOps e testes, e interesse em UX/UI design.",
    "skills": [
      "React",
      "Vue.js",
      "TypeScript",
      "Tailwind CSS",
      "Node.js",
      "Java",
      "Python",
      "PostgreSQL",
      "Docker",
      "Kubernetes",
      "AWS",
      "Jest",
      "Cypress",
      "Selenium"
    ],
    "education": "Bacharelado em Sistemas de Informação pela PUC-Rio e Curso Técnico em Informática pela FAETEC",
    "interview_questions": [
      "Como você aborda a integração de microsserviços com Docker e Kubernetes?",
      "Quais são suas estratégias para otimizar a performance de aplicações React?",
      "Como você avalia a manutenibilidade de um sistema legado?"
    ],
    "strengths": [
      "Experiência em desenvolvimento de software",
      "Habilidades em DevOps e testes",
      "Interesse em UX/UI design"
    ],
    "areas_for_development": [
      "Falta de experiência em análise de dados",
      "Limitações em conhecimentos em SQL e ferramentas de Business Intelligence"
    ],
    "important_considerations": [
      "Verificar a adaptação para uma vaga de análise de dados",
      "Avaliar a capacidade de aprender rapidamente sobre ferramentas de Business Intelligence"
    ],
    "final_recommendations": "A candidata apresenta uma sólida formação em desenvolvimento de software, mas carece de experiência em análise de dados. É recomendável uma entrevista para avaliar sua capacidade de aprender e se adaptar à vaga.",
    "score": 6.5
  },
  {
    "name": "Alex Costa",
    "area": "Desenvolvimento",
    "summary": "Profissional multidisciplinar com 5 anos de experiência em design, desenvolvimento front-end e estratégias de marketing digital, buscando aprimorar habilidades em design de interfaces complexas.",
    "skills": [
      "Design",
      "Front-End",
      "Marketing",
      "HTML/CSS",
      "JavaScript",
      "React.js",
      "Vue.js",
      "SASS",
      "Node.js",
      "Firebase",
      "Git",
      "Webpack",
      "Jira",
      "Zeplin",
      "A/B Testing"
    ],
    "education": "Bacharelado em Design Digital pela Universidade Federal do Paraná (UFPR) e Curso Técnico em Marketing Digital pelo Instituto de Tecnologia e Design (ITEDE)",
    "interview_questions": [
      "Como você integra design e desenvolvimento front-end em seus projetos?",
      "Como você aborda a análise de dados para otimizar a experiência do usuário?",
      "Como você trabalha colaborativamente com equipes multidisciplinares?"
    ],
    "strengths": [
      "Experiência em design de interfaces complexas",
      "Conhecimento em tecnologias front-end",
      "Habilidades em marketing digital",
      "Experiência em trabalho colaborativo"
    ],
    "areas_for_development": [
      "Limitada experiência em análise de dados",
      "Necessidade de desenvolver habilidades em análise estatística e modelagem de dados"
    ],
    "important_considerations": [
      "Verificar se as habilidades em design e desenvolvimento front-end podem ser adaptadas para análise de dados",
      "Avaliar a capacidade de aprendizado e adaptação à análise de dados"
    ],
    "final_recommendations": "Recomenda-se uma entrevista para avaliar melhor as habilidades e experiências do candidato e verificar se ele pode adaptar suas habilidades para a vaga de Analista de Dados",
    "score": 6.5
  }
]